KASTORPROJECT/src/DataProcessors/ЗагрузкаДанныхИзБазы1С/ЗагрузкаДанныхИзБазы1С.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ЗагрузкаДанныхИзБазы1С</name>
</mdclass:DataProcessor>

KASTORPROJECT/src/Catalogs/ПользователиИБ/ПользователиИБ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ПользователиИБ</name>
  <attributes>
    <name>ИнформационнаяБаза</name>
    <type>
      <types>CatalogRef.ИнформационныеБазы</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяПользователяИБ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Недействителен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПарольПользователяИБ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторПользователяИБ</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
</mdclass:Catalog>

KASTORPROJECT/src/DataProcessors/ЗагрузкаДанныхИзБазы1С/Forms/Форма/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
//	Если ТипЗнч(Параметры) = Тип("Структура") Тогда
//		
//	КонецЕсли;
	
	Если Параметры.Свойство("ИнформационнаяБаза") Тогда
		ИнформационнаяБаза = Параметры.ИнформационнаяБаза;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьПользователейИзБазыНаСервере()
	
	ТаблицаПользователей.Очистить();
	
	АдресХранилищаТабПользователи = ПоместитьВоВременноеХранилище(ТаблицаПользователей.Выгрузить());
	
	Обработки.ЗагрузкаДанныхИзБазы1С.ЗагрузитьПользователейИзБазы1С(ИнформационнаяБаза, АдресХранилищаТабПользователи);	
	
	ТабПользователи = ПолучитьИзВременногоХранилища(АдресХранилищаТабПользователи);
    ТаблицаПользователей.Загрузить(ТабПользователи);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьПользователейИзБазы(Команда)
	ЗагрузитьПользователейИзБазыНаСервере();
КонецПроцедуры

&НаСервере
Процедура СоздатьПользователейНаСервере()
	
	структПользователь = Новый Структура();
	структПользователь.Вставить("Наименование", "");
	структПользователь.Вставить("ФизическоеЛицо", "");
	структПользователь.Вставить("ИД", "");
	
	Для каждого Стр Из ТаблицаПользователей Цикл
		//будем создавать только отмеченнных
		Если НЕ Стр.Добавить Тогда
			Продолжить;
		КонецЕсли;     
		//и только если пользователя еще нет в базе
		Если ЗначениеЗаполнено(Стр.ПользовательИБСсылка) Тогда
			Продолжить;
		КонецЕсли;
		
		ЗаполнитьЗначенияСвойств(структПользователь, Стр);
		текПользователь = СоздатьПользователяИБ(Стр);
		
		Если текПользователь <> Неопределено Тогда
			Стр.Добавить = Ложь;
			Стр.ПользовательИБСсылка = текПользователь;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаСервере
Функция СоздатьПользователяИБ(структПользователь)
	
	ссылкаПользовательИБ	 = Справочники.ПользователиИБ.ПолучитьСсылку(Новый УникальныйИдентификатор(структПользователь.УИД));
	 
	Если ссылкаПользовательИБ = Справочники.ПользователиИБ.ПустаяСсылка() Тогда
		
		новПользовательИБ		 = Справочники.ПользователиИБ.СоздатьЭлемент();
		
		новПользовательИБ.УстановитьСсылкуНового(ссылкаПользовательИБ);
		новПользовательИБ.Наименование					 = структПользователь.Наименование;
		новПользовательИБ.ИдентификаторПользователяИБ	 = структПользователь.ИдентификаторПользователяИБ;
		новПользовательИБ.ИнформационнаяБаза			 = ИнформационнаяБаза;
		новПользовательИБ.Записать();
		
		ссылкаПользовательИБ = новПользовательИБ.Ссылка;
	КонецЕсли;
	
	Возврат ссылкаПользовательИБ;
	
КонецФункции

&НаКлиенте
Процедура СоздатьПользователей(Команда)
	СоздатьПользователейНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьКолонкаДобавить(нЗначение, ИмяТЧ)
	Для каждого Стр Из ЭтаФорма[ИмяТЧ] Цикл
		Стр.Добавить = нЗначение;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьВсе(Команда)
	ИзменитьКолонкаДобавить(Истина, "ТаблицаПользователей");
КонецПроцедуры

&НаКлиенте
Процедура ОтменитьВсе(Команда)
	ИзменитьКолонкаДобавить(Ложь, "ТаблицаПользователей");
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьОрганизацииИзБазыНаСервере()
	
	ТаблицаОрганизации.Очистить();
	
	АдресХранилищаТабОрганизации = ПоместитьВоВременноеХранилище(ТаблицаОрганизации.Выгрузить());
	
	Обработки.ЗагрузкаДанныхИзБазы1С.ЗагрузитьОрганизациийИзБазы1С(ИнформационнаяБаза, АдресХранилищаТабОрганизации);	
	
	ТабОрганизации = ПолучитьИзВременногоХранилища(АдресХранилищаТабОрганизации);
    ТаблицаОрганизации.Загрузить(ТабОрганизации);

КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьОрганизацииИзБазы(Команда)
	ЗагрузитьОрганизацииИзБазыНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьФизическиеЛицаИзБазыНаСервере()
	
	ТаблицаФизическиеЛица.Очистить();
	
	АдресХранилищаТабФизическиеЛица = ПоместитьВоВременноеХранилище(ТаблицаФизическиеЛица.Выгрузить());
	
	Обработки.ЗагрузкаДанныхИзБазы1С.ЗагрузитьФизическиеЛицаИзБазы1С(ИнформационнаяБаза, АдресХранилищаТабФизическиеЛица);	
	
	ТабФизическиеЛица = ПолучитьИзВременногоХранилища(АдресХранилищаТабФизическиеЛица);
    ТаблицаФизическиеЛица.Загрузить(ТабФизическиеЛица);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьФизическиеЛицаИзБазы(Команда)
	ЗагрузитьФизическиеЛицаИзБазыНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацииВыбратьВсе(Команда)
	ИзменитьКолонкаДобавить(Истина, "ТаблицаОрганизации");
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацииОтменитьВсе(Команда)
	ИзменитьКолонкаДобавить(Ложь, "ТаблицаОрганизации");
КонецПроцедуры

&НаКлиенте
Процедура ФизическиеЛицаВыбратьВсе(Команда)
	ИзменитьКолонкаДобавить(Истина, "ТаблицаФизическиеЛица");
КонецПроцедуры

&НаКлиенте
Процедура ФизическиеОтменитьВсе(Команда)
	ИзменитьКолонкаДобавить(Ложь, "ТаблицаФизическиеЛица");
КонецПроцедуры

&НаСервере
Процедура СоздатьФизическиеЛицаНаСервере()
	
	Для каждого Стр Из ТаблицаФизическиеЛица Цикл
		//будем создавать только отмеченнных
		Если НЕ Стр.Добавить Тогда
			Продолжить;
		КонецЕсли;     
		//и только если пользователя еще нет в базе
		Если ЗначениеЗаполнено(Стр.ФизическоеЛицоСсылка) Тогда
			Продолжить;
		КонецЕсли;
		
		
		
		ссылкаФЛ	 = Справочники.ФизическиеЛица.ПолучитьСсылку(Новый УникальныйИдентификатор(Стр.УИД));
		
		Если Найти(Строка(ссылкаФЛ), "<Объект не найден>") > 0 Тогда
			новФЛ = Справочники.ФизическиеЛица.СоздатьЭлемент();
            ЗаполнитьЗначенияСвойств(новФЛ, Стр);
			новФЛ.УстановитьСсылкуНового(ссылкаФЛ);
			новФЛ.Записать();                               
			
		    ссылкаФЛ = новФЛ.Ссылка;
			Если ссылкаФЛ <> Неопределено Тогда
				Стр.Добавить = Ложь;
				Стр.ФизическоеЛицоСсылка = ссылкаФЛ;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьФизическиеЛица(Команда)
	СоздатьФизическиеЛицаНаСервере();
КонецПроцедуры

&НаСервере
Процедура СоздатьОрганизацииНаСервере()
	
	Для каждого Стр Из ТаблицаОрганизации Цикл
		//будем создавать только отмеченнных
		Если НЕ Стр.Добавить Тогда
			Продолжить;
		КонецЕсли;     
		//и только если пользователя еще нет в базе
		Если ЗначениеЗаполнено(Стр.ОрганизацияСсылка) Тогда
			Продолжить;
		КонецЕсли;
		
		
		
		ссылкаОрганизация	 = Справочники.Организации.ПолучитьСсылку(Новый УникальныйИдентификатор(Стр.УИД));
	 
		Если Найти(Строка(ссылкаОрганизация), "<Объект не найден>") > 0 Тогда
			новОрганизация = Справочники.Организации.СоздатьЭлемент();
            ЗаполнитьЗначенияСвойств(новОрганизация, Стр);
			новОрганизация.УстановитьСсылкуНового(ссылкаОрганизация);
			новОрганизация.Записать();                               
			
		    ссылкаОрганизация = новОрганизация.Ссылка;
			Если ссылкаОрганизация <> Неопределено Тогда
				Стр.Добавить = Ложь;
				Стр.ОрганизацияСсылка = ссылкаОрганизация;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура СоздатьОрганизации(Команда)
	СоздатьОрганизацииНаСервере();
КонецПроцедуры


&НаКлиенте
Процедура СоздатьВоВнешнейБазе(Команда)
	СоздатьПользователейВоВнешнейБазеНаСервере();
КонецПроцедуры

&НаСервере
Процедура СоздатьПользователейВоВнешнейБазеНаСервере()
	
	Для каждого Стр Из ТаблицаПользователей Цикл
		
		Если НЕ Стр.Добавить Тогда
			Продолжить;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Стр.ИдентификаторПользователяИБ) Тогда
			Продолжить; 
		КонецЕсли;
		
		СоздатьОдногоПользователяВоВнешнейБазе(Стр);
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура СоздатьОдногоПользователяВоВнешнейБазе(Стр)
	
	Попытка
		
		Соединение = Обработки.ЗагрузкаДанныхИзБазы1С.ПолучитьСоединениеСБазой(ИнформационнаяБаза);
		Если Соединение = Неопределено Тогда
			Сообщить("Не удалось подключиться к базе: " + ИнформационнаяБаза);
			Возврат;
		КонецЕсли;
		
				ПользовательИБ = Соединение.Пользователи.СоздатьПользователяИБ();
		ПользовательИБ.Имя           = Стр.Имя;                    // или Login
		ПользовательИБ.ПолноеИмя     = Стр.Наименование;
		ПользовательИБ.АутентификацияСтандартная = Истина;
		
		Если ЗначениеЗаполнено(Стр.Пароль) Тогда
			ПользовательИБ.Пароль = Стр.Пароль;
		КонецЕсли;
		
		ПользовательИБ.Записать();
		
		
		ОбновитьРеквизитыПользователяИБ(Стр, ПользовательИБ.УникальныйИдентификатор);
		
		Стр.Добавить = Ложь;
		Сообщить("Создан пользователь: " + Стр.Наименование);
		
	Исключение
		Сообщить("Ошибка создания пользователя " + Стр.Наименование + ": " + ОписаниеОшибки());
	КонецПопытки;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьРеквизитыПользователяИБ(Стр, НовыйИдентификатор)
	
	ОбъектСпр = Стр.ПользовательИБСсылка.ПолучитьОбъект();
	ОбъектСпр.ИдентификаторПользователяИБ = НовыйИдентификатор;
	ОбъектСпр.Записать();
	
КонецПроцедуры


&НаКлиенте
Процедура ОбновитьВоВнешнейБазе(Команда)
	ОбновитьПользователейВоВнешнейБазеНаСервере();
КонецПроцедуры

&НаСервере
Процедура ОбновитьПользователейВоВнешнейБазеНаСервере()
	Для каждого Стр Из ТаблицаПользователей Цикл
		Если НЕ Стр.Добавить Тогда Продолжить; КонецЕсли;
		ОбновитьОдногоПользователяВоВнешнейБазе(Стр);
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ОбновитьОдногоПользователяВоВнешнейБазе(Стр)
	Попытка
		Соединение = Обработки.ЗагрузкаДанныхИзБазы1С.ПолучитьСоединениеСБазой(ИнформационнаяБаза);
		ПользовательИБ = Соединение.Пользователи.НайтиПоИмени(Стр.Имя);
		
		Если ПользовательИБ <> Неопределено Тогда
			ПользовательИБ.ПолноеИмя = Стр.Наименование; 
			ПользовательИБ.Записать();
			Сообщить("Обновлён: " + Стр.Наименование);
		КонецЕсли;
	Исключение
		Сообщить("Ошибка обновления " + Стр.Наименование);
	КонецПопытки;
КонецПроцедуры    

&НаКлиенте
Процедура УдалитьВоВнешнейБазе(Команда)
	
	Если ТаблицаПользователей.НайтиСтроки(Новый Структура("Добавить", Истина)).Количество() = 0 Тогда
		ПоказатьПредупреждение(, "Не выбрано ни одного пользователя для удаления.");
		Возврат;
	КонецЕсли;
	
	ПоказатьВопрос(Новый ОписаниеОповещения("УдалитьВоВнешнейБазеПослеВопроса", ЭтотОбъект),
		"Вы действительно хотите удалить выбранных пользователей из внешней базы?" + Символы.ПС +
		"Операция необратима!", РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Нет);
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьВоВнешнейБазеПослеВопроса(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	УдалитьПользователейВоВнешнейБазеНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура УдалитьПользователейВоВнешнейБазеНаСервере()
	
	Для каждого Стр Из ТаблицаПользователей Цикл
		
		Если НЕ Стр.Добавить Тогда
			Продолжить;
		КонецЕсли;
		
		УдалитьОдногоПользователяВоВнешнейБазе(Стр);
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура УдалитьОдногоПользователяВоВнешнейБазе(Стр)
	
	Попытка
		Соединение = Обработки.ЗагрузкаДанныхИзБазы1С.ПолучитьСоединениеСБазой(ИнформационнаяБаза);
		Если Соединение = Неопределено Тогда
			Сообщить("Не удалось подключиться к базе для пользователя: " + Стр.Наименование);
			Возврат;
		КонецЕсли;
		
		// Ищем пользователя по имени
		ПользовательИБ = Соединение.Пользователи.НайтиПоИмени(Стр.Имя); // или по другому полю
		
		Если ПользовательИБ <> Неопределено Тогда
			ПользовательИБ.Удалить();
			Сообщить("Удалён пользователь: " + Стр.Наименование);
			
			// Очищаем идентификатор в нашей базе
			Если ЗначениеЗаполнено(Стр.ПользовательИБСсылка) Тогда
				ОбъектСпр = Стр.ПользовательИБСсылка.ПолучитьОбъект();
				ОбъектСпр.ИдентификаторПользователяИБ = "";
				ОбъектСпр.Записать();
			КонецЕсли;
			
		Иначе
			Сообщить("Пользователь " + Стр.Наименование + " не найден во внешней базе.");
		КонецЕсли;
		
	Исключение
		Сообщить("Ошибка удаления пользователя " + Стр.Наименование + ": " + ОписаниеОшибки());
	КонецПопытки;
	
КонецПроцедуры
